<template>
  <div class="dt-pages policy-agreement-page">
    <div class="dt-header">
      <dtHeader title="保单托管服务协议" :leftBack="false" @headerLeft="goBack"></dtHeader>
    </div>
    <div class="dt-content">
        <div class="title">保单托管服务协议</div>
        <div class="text-content">
        <p class="tit">【首部及导言】  </p>
        <p>欢迎您使用保单托管服务！ </p>
        <p>为使用保单托管服务（以下统称“本服务”)，您应当阅读并同意《保单托管服务协议》（以下简称“本协议”）。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项具体服务的单独协议，并选择接受或不接受。限制、免责条款可能以加粗形式提示您注意。除非您已阅读并接受本协议所有条款，否则请您不要使用相关服务。您的开通、使用等行为即视为您已阅读并同意本协议的约束。如果您未满 18 周岁，请在法定监护人的陪同下阅读并同意本协议，并特别注意未成年人使用条款。</p>

        <p class="tit">一、【协议的范围】</p>
        <p>1.1 【协议适用主体范围】 </p>
        <p>本协议是您与保小秘之间关于您开通、使用本服务所订立的协议。 </p>
        <p>1.2 【协议关系及冲突条款】</p>
        <p>本协议的内容，包括但不限于以下与本服务相关的协议、规则、规范以及保小秘可能不断发布的关于本服务的相关协议、规则、规范等内容，前述内容一经正式发布，即为本协议不可分割的组成部分，与其构成统一整体，若您继续使用本服务，您同样应当遵守上述协议的要求。</p>

        <p class="tit">二、【关于本服务】</p>
        <p>2.1【本服务内容】</p>
        <p>本服务是指保小秘向您提供保单托管、制作家庭保障分析报告、智能测需、专业名片等的相关服务。</p>
        <p>2.2【本服务形式】</p>
        <p>您可以通过电脑、手机等终端以客户端、网页、H5页面等形式使用本服务，具体以保小秘提供的为准，同时，保小秘将不断丰富您使用本服务的终端、形式等。当您使用本服务时，您应选择与您的终端、系统等相匹配的软件或者服务版本或者服务，否则，您可能无法正常使用本服务。</p>
        <p>2.3【许可的范围】</p>
        <p>2.3.1保小秘给予您一项个人的、不可转让及非排他性的许可以使用本服务。您可以为非商业目的在终端设备上开通、使用本服务。</p>
        <p>2.3.2 本条及本协议其他条款未明示授权的其他一切权利仍由保小秘保留，您在行使这些权利时须另外取得保小秘的书面许可。保小秘如果未行使前述任何权利，并不构成对该权利的放弃。</p>

        <p class="tit"> 三、【服务的更新】 </p>
        <p> 3.1 为了增进用户体验、完善服务内容，保小秘将不断努力完善现有服务并开发新的服务，并为您不时提供服务更新（这些更新可能会釆取服务替换、修改、功能强化等形式）。</p>
        <p> 3.2为了改善用户体验,并保证服务的安全性和功能的一致性,保小秘有权不经向您特别通知而对服务进行更新,或者对服务的部分功能效果进行改变或限制。</p>

         <p class="tit">  四、【用户个人信息保护和授权】</p>
         <p> 4.1保护用户个人信息是保小秘的一项基本原则,保小秘将会采取合理的措施保护用户的个人信息。除法律法规规定或本协议约定的情形外,未经用户许可保小秘不会向第三方公开、透露用户个人信息。保小秘对相关信息采用专业加密存储与传输方式,保障用户个人信息的安全。</p>
         <p> 4.2您在注册帐号或开通使用本服务的过程中,可能需要填写一些必要的信息。您需要填写真实的身份信息以获取相应的服务,若您填写的信息不完整或不准确,则无法使用本服务或在使用过程中受到限制。</p>
         <p> 4.3一般情况下,您可随时浏览、修改自己提交的信息,但出于安全性和身份识别(如帐号申诉服务等)的考虑,您可能无法修改注册时提供的初始注册信息及其他验证信息。</p>
         <p> 4.4保小秘将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息,以免遭受未经授权的访问、使用或披露。</p>
         <p> 4.5保小秘非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人,在使用本服务前,应事先取得您家长或法定监护人的书面同意。</p>
         <p> 4.6您同意并授权保小秘将您的信息用于如下用途:</p>
         <p>  (1)为了向您提供本服务之用,允许保小秘向保险公司查询您本人和您的客户名下的全部保单;</p>
         <p> (2)为了向您提供本服务之用,允许保小秘展示您本人和您的客户名下的全部保单；</p>
         <p> (3)为了验证您的真实身份,允许保小秘及验证服务平台使用您的实名认证信息；</p>
         <p> (4)帮助保小秘设计新服务、改善现有服务、提升您的服务体验之用；</p>
         <p> (5)为了更好的为您提供某些产品或服务,可能会向您进行电话呼叫或短信等推送通知。</p>
         <p class="tit"> 五、【用户行为规范】</p>
         <p> 5.1【用户注意事项】</p>
         <p> 您理解并同意:保小秘将会尽其合理努力保障您在本服务中的数据存储安全,但是,保小秘并不能就此提供完全保证,包括但不限于以下情形:</p>
         <p> (1)保小秘不对您在本服务中相关数据的删除或储存失败负责;</p>
         <p> (2)保小秘有权根据实际情况自行决定您在本服务中数据的最长储存期限、服务器中数据的最大存储空间等,您可根据自己的需要自行备份本服务中的相关数据。</p>
         <p> (3)如果您停止使用本服务或本服务被终止或取消,保小秘可以从服务器上永久地删除您的数据。您的服务停止、终止或取消后,保小秘没有义务向您返还任何数据,因此请您及时做好数据备份相关工作。</p>
         <p> 5.2【五不准】</p>
         <p> 您在使用本服务时不得利用本服务从事以下行为,包括但不限于:</p>
         <p> (1)发布、传送、传播、储存违反国家法律、危害国家安全统一、社会稳定、公序良俗、社会公德以及侮辱、诽谤、淫秽、暴力的内容;</p>
         <p> (2)发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容;</p>
         <p> (3)虛构事实、隐瞒真相以误导、欺骗他人;</p>
         <p> (4)发表、传送、传播广告信息及垃圾信息;</p>
         <p> (5)从事其他违反法律法规、政策及公序良俗、社会公德等的行为。</p>
         <p> 5.3【用户禁止行为】</p>
         <p> 除非法律允许或保小秘书面许可,您不得从事下列行为：</p>
         <p> (1)删除本服务及其副本上关于著作权的信息;</p>
         <p> (2)不得使用未经保小秘授权的插件、外挂或第三方工具对本协议项下的服务进行干扰、破坏、修改或施加其他影响;</p>
         <p> (3)对保小秘拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、岀版、建立镜像站点等;</p>
         <p> (4)对本服务运行过程中释放到任何终端内存中的数据、软件或者服务运行过程中客户端与服务器端的交互数据,以及本服务运行所必需的系统数据,进行复制、修改、增加、删除、挂接运行或创作任何衍生作品,形式包括但不限于使用插件、外挂或非保小秘经授权的第三方工具/服务接入本服务和相关系统;</p>
         <p> (5)通过修改或伪造服务运行中的指令、数据,增加、删减、变动服务的功能或运行效果；</p>
         <p> (6)通过非保小秘开发、授权的第三方软件或者服务、插件、外挂、系统,登录或使用保小秘软件或者服务及服务,或制作、发布、传播上述工具；</p>
         <p> (7)自行、授权他人或利用第三方软件或者服务对本服务及其组件、模块、数据等进行干扰;</p>
         <p> (8)其他未经保小秘明示授权、许可或违反本协议及相关协议、规则的行为。</p>
         <p> 5.4【对自己行为负责】</p>
         <p> 您充分了解并同意,您必须为自己注册帐号及本服务项下的一切行为负责,保小秘无法且不会对您因下述风险而导致的任何损失或损害承担责任:</p>
         <p> (1)您应对使用本服务时接触到的内容自行加以判断,并承担因使用内容而引起的所有风险,包括但不限于因对内容的正确性、完整性或实用性的依赖而产生的风险;</p>
         <p> (2)您提供的电子邮件地址、手机或座机号码等联系方式无法及时与您取得联系,导致您在使用本服务过程中产生任何损失或增加费用。</p>
         <p> (3)您使用本服务为客户整理保单、生成家庭保障分析报告及智能测需等行为，承担使用客户个人信息等资料遭到投诉而产生的风险。</p>
         <p> 5.5【违约处理】</p>
         <p> 如果保小秘发现或收到他人举报您有违反本协议约定的,保小秘有权不经通知随时对相关内容进行删除、屏蔽,并采取包括但不限于暂停、终止您使用相应保单托管服务,暂停、终止您使用部分或全部服务,向您追究法律责任等措施。</p>

         <p class="tit"> 六、【知识产权声明】</p>
         <p> 6.1保小秘是本服务的知识产权权利人。本服务的著作权、商标权、专利权、商业秘密等知识产权,以及与本服务相关的所有信息内容(包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等)均受中华人民共和国法律法规和相应的国际条约保护,保小秘依法享有上述相关知识产权,但相关权利人依照法律规定应享有的权利除外。</p>
         <p> 6.2未经保小秘或相关权利人书面同意,您不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。</p>
         <p> 七、【终端安全责任】</p>
         <p> 7.1您理解并同意,本服务同大多数互联网服务一样,可能会受多种因素影响(包括但不限于用户原因、网络服务质量、社会环境等);也可能会受各种安全问题的侵扰(包括但不限于他人非法利用用户资料,进行现实中的骚扰;用户下载安装的其他软件或者服务或访问的其他网站中可能含有病毒、木马程序或其他恶意程序,威胁您终端的信息和数据的安全,继而影响本服务的正常使用等)。因此,您应加强信息安全及个人信息的保护意识,注意密码保护,以免遭受损失。</p>
         <p> 7.2您不得制作、发布、使用、传播用于窃取他人个人信息、财产的恶意程序。</p>
         <p> 7.3在任何情况下,您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的,请一定先核实对方身份,并请经常留意保小秘有关防范诈骗犯罪的提示。</p>
         <p> 7.4您应当妥善保管您的账号信息,并对通过该账号进行的所有行为负责。您保证不向其他任何人泄露账号信息,如您发现任何人冒用或盗用您的账号信息或有任何其他可能危及您的账号安全的情形时,您应当立即以有效方式通知保小秘。</p>
         <p class="tit"> 八、【其他】</p>
         <p> 8.1您使用本服务即视为您已阅读并同意受本协议的约束。保小秘有权在必要时修改本协议条款。您可以在本服务的最新版本中查阅相关协议条款。本协议条款变更后,如果您继续使用本服务即视为您已接受修改后的协议。如果您不接受修改后的协议,应当停止使用本服务。</p>
         <p> 8.2本协议的成立、生效、履行、解释及纠纷解决,适用中华人民共和国大陆地区法律(不包括冲突法)。</p>
         <p> 8.3若您和保小秘之间发生任何纠纷或争议,首先应友好协商解决;协商不成的,您同意将纠纷或争议提交保小秘所在地的人民法院管辖。</p>
         <p> 8.4本协议所有条款的标题仅为阅读方便,本身并无实际涵义,不能作为本协议涵义解释的依据。</p>
         <p> 8.5本协议条款无论因何种原因部分无效或不可执行,其余条款仍有效,对双方具有约束力。</p>

         <p class="foot">保小秘</p>
        </div>
    </div>
  </div>
</template>
<script>
import dtHeader from "@/components/dtHeader";
import { getDevice } from "@/config/utils.js";
export default {
  name: "policyAgreement",
  components: {
    dtHeader
  },
  data() {
    return {
      device: getDevice()
    };
  },
  created() {},
  methods: {
    goBack() {
      let device = this.device;
      if (device == "android") {
        bmAndroid.goHomePage();
      } else if (device == "ios" || device == "iPhoneX") {
        let isPc = this.$store.state.isPc;
        if (!isPc) {
          window.webkit.messageHandlers.goHomePage.postMessage(null);
        } else {
          this.$router.go(-1);
        }
      } else {
        this.$router.go(-1);
      }
    }
  }
};
</script>
<style lang="less">
// 注意：在rootValue = 750px的设计稿中
// 现在 title cell 的高度为125
// 普通cell的高度为100
@dt-bbbbbb: #bbbbbb;
@dt-f9545: #f95454;
@dt-ffffff: #ffffff;
@dt-iconcolor: #dedede;

.policy-agreement-page {
  .dt-content {
    overflow: auto;
    position: relative;
    padding: 30px;
    -webkit-overflow-scrolling: touch;
  }
  .title {
    font-weight: bold;
    font-size: 30px;
    text-align: center;
  }
  .text-content {
    line-height: 50px;
    font-size: 26px;
    p {
      margin-top: 10px;
      text-indent: 24px;
    }
    .tit {
      font-weight: bold;
      text-indent: 0;
    }
    .foot {
      text-align: right;
    }
  }
}
</style>
